atom_deepseekr1/logs/fp8/benchmark_results_isl10000_osl1000_conc128.log

========================================
Running benchmark:
  Input tokens: 10000
  Output tokens: 1000
  Max concurrency: 128
  Num prompts: 1280
  Resquest rate: inf
  Started at: Wed Dec 17 07:43:17 UTC 2025
========================================
Namespace(backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, max_concurrency=128, model='/shared/amdgpu/home/share/deepseek/DeepSeek-R1', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=1280, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, metadata=None, result_dir='logs', result_filename='deepseek_r1_FP8_tp8_isl10000_osl1000_conc128_infrrate.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=10000, random_output_len=1000, random_range_ratio=1.0, random_prefix_len=0, use_chat_template=False, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 128
100%|██████████| 1280/1280 [03:30<00:00,  6.09it/s]
============ Serving Benchmark Result ============
Successful requests:                     128       
Benchmark duration (s):                  210.02    
Total input tokens:                      1280000   
Total generated tokens:                  109       
Request throughput (req/s):              0.61      
Output token throughput (tok/s):         0.52      
Total Token throughput (tok/s):          6095.31   
---------------Time to First Token----------------
Mean TTFT (ms):                          18636.03  
Median TTFT (ms):                        18992.84  
P99 TTFT (ms):                           32235.76  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-token Latency----------------
Mean ITL (ms):                           30002.59  
Median ITL (ms):                         30000.38  
P99 ITL (ms):                            30004.88  
----------------End-to-end Latency----------------
Mean E2EL (ms):                          44185.11  
Median E2EL (ms):                        43501.60  
P99 E2EL (ms):                           61477.40  
==================================================

Completed at: Wed Dec 17 07:47:29 UTC 2025
========================================